perf/resultado_bbox_1_load_15.txt

> perf@1.0.0 artillery /home/hugo/Desktop/Arq de Soft/Tp1/2c21-tp-1/perf
> artillery "run" "load-bbox.yaml" "-e" "black_box_1"

Started phase 0 (Load), duration: 600s @ 18:00:07(-0300) 2021-10-16
Report @ 18:00:17(-0300) 2021-10-16
Elapsed time: 10 seconds
  Scenarios launched:  149
  Scenarios completed: 136
  Requests completed:  136
  Mean response/sec: 15.01
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 902.3
  Codes:
    200: 136

Report @ 18:00:27(-0300) 2021-10-16
Elapsed time: 20 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 924
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:00:37(-0300) 2021-10-16
Elapsed time: 30 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:00:47(-0300) 2021-10-16
Elapsed time: 40 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:00:57(-0300) 2021-10-16
Elapsed time: 50 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:01:07(-0300) 2021-10-16
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:01:17(-0300) 2021-10-16
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:01:27(-0300) 2021-10-16
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:01:37(-0300) 2021-10-16
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:01:47(-0300) 2021-10-16
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:01:57(-0300) 2021-10-16
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:02:07(-0300) 2021-10-16
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:02:17(-0300) 2021-10-16
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:02:27(-0300) 2021-10-16
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:02:37(-0300) 2021-10-16
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:02:47(-0300) 2021-10-16
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:02:57(-0300) 2021-10-16
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:03:07(-0300) 2021-10-16
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:03:17(-0300) 2021-10-16
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:03:27(-0300) 2021-10-16
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:03:37(-0300) 2021-10-16
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:03:47(-0300) 2021-10-16
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:03:57(-0300) 2021-10-16
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:04:07(-0300) 2021-10-16
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 905
    median: 901
    p95: 902
    p99: 904
  Codes:
    200: 150

Report @ 18:04:17(-0300) 2021-10-16
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:04:27(-0300) 2021-10-16
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:04:37(-0300) 2021-10-16
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:04:47(-0300) 2021-10-16
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:04:57(-0300) 2021-10-16
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:05:07(-0300) 2021-10-16
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:05:17(-0300) 2021-10-16
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:05:27(-0300) 2021-10-16
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:05:37(-0300) 2021-10-16
Elapsed time: 5 minutes, 30 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:05:47(-0300) 2021-10-16
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:05:57(-0300) 2021-10-16
Elapsed time: 5 minutes, 50 seconds
  Scenarios launched:  151
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:06:07(-0300) 2021-10-16
Elapsed time: 6 minutes, 0 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:06:17(-0300) 2021-10-16
Elapsed time: 6 minutes, 10 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:06:27(-0300) 2021-10-16
Elapsed time: 6 minutes, 20 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:06:37(-0300) 2021-10-16
Elapsed time: 6 minutes, 30 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:06:47(-0300) 2021-10-16
Elapsed time: 6 minutes, 40 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.1
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:06:57(-0300) 2021-10-16
Elapsed time: 6 minutes, 50 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.11
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:07:07(-0300) 2021-10-16
Elapsed time: 7 minutes, 0 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 14.99
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:07:17(-0300) 2021-10-16
Elapsed time: 7 minutes, 10 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.12
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:07:27(-0300) 2021-10-16
Elapsed time: 7 minutes, 20 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:07:37(-0300) 2021-10-16
Elapsed time: 7 minutes, 30 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:07:47(-0300) 2021-10-16
Elapsed time: 7 minutes, 40 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:07:57(-0300) 2021-10-16
Elapsed time: 7 minutes, 50 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 150

Report @ 18:08:07(-0300) 2021-10-16
Elapsed time: 8 minutes, 0 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:08:17(-0300) 2021-10-16
Elapsed time: 8 minutes, 10 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:08:27(-0300) 2021-10-16
Elapsed time: 8 minutes, 20 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:08:37(-0300) 2021-10-16
Elapsed time: 8 minutes, 30 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:08:47(-0300) 2021-10-16
Elapsed time: 8 minutes, 40 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:08:57(-0300) 2021-10-16
Elapsed time: 8 minutes, 50 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:09:07(-0300) 2021-10-16
Elapsed time: 9 minutes, 0 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:09:17(-0300) 2021-10-16
Elapsed time: 9 minutes, 10 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 908
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:09:27(-0300) 2021-10-16
Elapsed time: 9 minutes, 20 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 150

Report @ 18:09:37(-0300) 2021-10-16
Elapsed time: 9 minutes, 30 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:09:47(-0300) 2021-10-16
Elapsed time: 9 minutes, 40 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:09:57(-0300) 2021-10-16
Elapsed time: 9 minutes, 50 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Started phase 1 (End), duration: 10s @ 18:10:07(-0300) 2021-10-16
Report @ 18:10:07(-0300) 2021-10-16
Elapsed time: 10 minutes, 0 seconds
  Scenarios launched:  150
  Scenarios completed: 150
  Requests completed:  150
  Mean response/sec: 15.09
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 150

Report @ 18:10:17(-0300) 2021-10-16
Elapsed time: 10 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 14
  Requests completed:  14
  Mean response/sec: NaN
  Response time (msec):
    min: 901
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 14

Report @ 18:10:17(-0300) 2021-10-16
Elapsed time: 10 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 18:10:17(-0300) 2021-10-16
  Scenarios launched:  9000
  Scenarios completed: 9000
  Requests completed:  9000
  Mean response/sec: 14.74
  Response time (msec):
    min: 900
    max: 924
    median: 901
    p95: 901
    p99: 902
  Scenario counts:
    Root (/): 9000 (100%)
  Codes:
    200: 9000